# 2.Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
# Объяснить полученный результат.
import sys

a = 5
b = 6

print(f'{a} = {bin(a)}')
print(f'{b} = {bin(b)}')

print(f'AND: {a} & {b} = {a & b} ({bin(a & b)})')
print(f'OR: {a} | {b} = {a | b} ({bin(a | b)})')
print(f'XOR: {a} ^ {b} = {a ^ b} ({bin(a ^ b)})')
print(f'{a} << 2 = {a << 2} ({bin(a << 2)})')
print(f'{a} >> 2 = {a >> 2} ({bin(a >> 2)})')


print(f'Для числа {bin(a << 2)} памяти затрачено: {sys.getsizeof(bin(a << 2))} | {bin(a << 2).__sizeof__()} bytes')
print(f'Для числа {a << 2} памяти затрачено: {sys.getsizeof(a << 2)} | {(a << 2).__sizeof__()} bytes')

# Для числа 0b10100 памяти затрачено: 32 | 32 bytes
# Для числа 20 памяти затрачено: 14 | 14 bytes
